export const CLASSES = [
  'א1', 'א2', 'א3', 'א4',
  'ב1', 'ב2', 'ב3', 'ב4',
  'ג1', 'ג2', 'ג3', 'ג4',
  'ד1', 'ד2', 'ד3', 'ד4', 'ד5',
  'ה1', 'ה2', 'ה3', 'ה4',
  'ו1', 'ו2', 'ו3', 'ו4', 'ו5',
  'ז1', 'ז2', 'ז3', 'ז4', 'ז5',
  'ח1', 'ח2', 'ח3', 'ח4', 'ח5', 'ח6'
];

export const DAYS = ['ראשון', 'שני', 'שלישי', 'רביעי', 'חמישי', 'שישי'];
export const HOURS = [1, 2, 3, 4, 5, 6, 7, 8, 9];

export const HOUR_TIMES: Record<number, string> = {
  1: '08:05 - 08:55',
  2: '08:55 - 09:45',
  3: '10:15 - 11:00',
  4: '11:00 - 11:45',
  5: '12:00 - 12:45',
  6: '12:45 - 13:30',
  7: '13:45 - 14:30',
  8: '14:30 - 15:15',
  9: '15:15 - 16:00',
};

export const BREAKS = [
  { afterHour: 2, name: 'הפסקת אוכל', time: '09:45 - 10:15' },
  { afterHour: 4, name: 'הפסקה', time: '11:45 - 12:00' },
  { afterHour: 6, name: 'הפסקת צהריים', time: '13:30 - 13:45' }
];

export const SUBJECTS = [
  'מתמטיקה/חשבון',
  'שפה',
  'אנגלית',
  'מדעים',
  'תנך',
  'תרבות ישראל',
  'שבילי מורשת',
  'שבילי המורשת והמולדת',
  'גיאוגרפיה',
  'הסטוריה',
  'ערבית',
  'אומנות',
  'ספריית פיג\'מות',
  'מוסיקה',
  'חווה חקלאית',
  'כישורי חיים',
  'חינוך חברתי',
  'גינה חקלאית',
  'חינוך גופני',
  'זה"ב',
  'מחשבים',
  'תיאטרון',
  'פרטני'
];
